# tap is to add additional sources of brew packages
# like "source" in a Gemfile
# brew tap ...
tap "buo/cask-upgrade"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

# brew is for Terminal/CLI libraries/software
# brew install ...
brew "check_postgres"
brew "chruby"
brew "ffmpeg"
brew "gh"
brew "github-keygen"
brew "imagemagick"
brew "mas"
brew "postgresql@17", restart_service: true
brew "redis", restart_service: true
brew "ruby-install"
brew "yamllint"
brew "yt-dlp"
brew "heroku/brew/heroku"
brew "imageoptim-cli"
brew "exif"

# cask is for macOS/GUI software installed from the internet
# brew install --cask firefox
cask "exiftool"
cask "applite"
cask "betterdisplay"
cask "betterzip"
cask "capcut"
cask "carbon-copy-cloner"
cask "dropbox"
cask "file-juicer"
cask "firefox"
cask "flickr-uploadr"
cask "focusrite-control"
cask "handbrake"
cask "imageoptim"
cask "netnewswire"
cask "obsidian"
cask "plex"
cask "sf-symbols"
cask "signal"
cask "sketch" # replace with my older version
cask "spotify"
cask "textmate"
cask "tor-browser"
cask "transmission"
cask "vlc"
cask "waltr-heic-converter"
cask "zed"
cask "zoom"


# These are Installable as casks, but I prefer mas for auto-updates
# Discord
# Divvy
# GrandPerspective
# Kiwix
# LocalSend
# MediaInfo
# Name Mangler
# Slack
# Transmit


# mas is for Mac App Store apps
# mas install [APP ID]
mas "Acorn", id: 1233861775
mas "Adblock Plus", id: 1432731683
mas "Any File Info", id: 731859284
mas "Apple Developer", id: 640199958
mas "Cardhop", id: 1290358394
mas "Cinch", id: 412529613
mas "Classic Color Meter", id: 451640037
mas "Croissant", id: 1662287582
mas "ExifInfo", id: 1515059152
mas "Fantastical", id: 975937182
mas "File Extractor", id: 1129674765
mas "Final Cut Pro", id: 424389933
mas "Firewatch", id: 1164603847
mas "Flighty", id: 1358823008
mas "FuzzyTime", id: 950297057
mas "GarageBand", id: 682658836
mas "GrandPerspective", id: 1111570163
mas "HEIC Converter", id: 1294126402
mas "Highland 2", id: 1171820258
mas "iBooks Author", id: 490152466
mas "iMovie", id: 408981434
mas "Ivory", id: 6444602274
mas "JPEGmini", id: 498944723
mas "Keynote", id: 409183694
mas "Lightweight PDF", id: 1450640351
mas "Logic Pro", id: 634148309
mas "Marked 2", id: 890031187
mas "MarsEdit", id: 1198319098
mas "Metapho", id: 914457352
mas "Name Mangler 3", id: 603637384
mas "Numbers", id: 409203825
mas "OmniOutliner", id: 1142578772
mas "Openvibe", id: 1666230916
mas "Oregon ONE Mobile", id: 6446165914
mas "Pages", id: 409201541
mas "Photomator", id: 1444636541
mas "PNG Compressor", id: 434886325
mas "Reeder Classic", id: 1529448980
mas "Reeder", id: 6475002485
mas "Refined GitHub", id: 1519867270
mas "Rivermark 2", id: 723593886
mas "Save to Pinterest", id: 6473649042
mas "Shazam", id: 897118787
mas "Slack", id: 803453959
mas "Slugline 2", id: 1483507254
mas "SQLiteFlow", id: 1406266008
mas "StopTheMadness", id: 1376402589
mas "StuffIt Expander", id: 405580712
mas "Information Superhighway", id: 1494503555
mas "Tapestry Loom", id: 6578414736
mas "Tapestry", id: 6448078074
mas "Things", id: 904280696
mas "Transmit", id: 1436522307
mas "Unzip - RAR ZIP 7Z Unarchiver", id: 1537056818
mas "Xcode", id: 497799835
mas "Yubico Authenticator", id: 1476679808
