tap "buo/cask-upgrade"
tap "codekitchen/dinghy"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"

brew "automake"
brew "bison"
brew "gdbm"
brew "libffi"
brew "readline"
brew "glib"
brew "chruby"
brew "cmake"
brew "ffmpeg"
brew "gcc"
brew "gh"
brew "ghostscript"
brew "git"
brew "github-keygen"
brew "graphviz"
brew "hub"
brew "shared-mime-info"
brew "imagemagick"
brew "libxml2"
brew "libspatialite"
brew "libyaml"
brew "lzlib"
brew "mas"
brew "mupdf"
brew "nginx"
brew "node"
brew "nvm"
brew "openssl@3"
brew "pandoc"
brew "qt"
brew "poppler"
brew "postgresql", restart_service: true
brew "ruby-install"
brew "wget"
brew "yamllint"
brew "yarn"
brew "youtube-dl"
brew "codekitchen/dinghy/dinghy"
brew "heroku/brew/heroku"
cask "atom"
cask "backblaze"
cask "chromedriver"
cask "flickr-uploadr"
cask "kindle"
cask "telegram"
cask "xquartz"
cask "zoom"

mas "Acorn",               id: 1233861775
mas "Adblock Plus",        id: 1432731683
mas "Any File Info",       id: 731859284
mas "Cardhop",             id: 1290358394
mas "Cinch",               id: 412529613
mas "Fantastical",         id: 975937182
mas "File Extractor",      id: 1129674765
mas "Fotor Photo Editor",  id: 503039729
mas "GarageBand",          id: 682658836
mas "Ghostery Lite",       id: 1436953057
mas "GrandPerspective",    id: 1111570163
mas "Highland 2",          id: 1171820258
mas "iBooks Author",       id: 490152466
mas "iMovie",              id: 408981434
mas "JPEGmini",            id: 498944723
mas "Keynote",             id: 409183694
mas "Lightweight PDF",     id: 1450640351
mas "Marked 2",            id: 890031187
mas "MarsEdit",            id: 1198319098
mas "Monosnap",            id: 540348655
mas "Name Mangler",        id: 603637384
mas "Numbers",             id: 409203825
mas "OmniOutliner",        id: 1142578772
mas "Pages",               id: 409201541
mas "PNG Compressor",      id: 434886325
mas "Reeder",              id: 1529448980
mas "Reeder",              id: 880001334
mas "Scapple",             id: 568020055
mas "Scrivener",           id: 1310686187
mas "Shazam",              id: 897118787
mas "Slack",               id: 803453959
mas "Slugline",            id: 553754186
mas "Slugline 2",          id: 1483507254
mas "StopTheMadness",      id: 1376402589
mas "StuffIt Expander",    id: 405580712
mas "Things",              id: 904280696
mas "Transmit",            id: 1436522307
mas "Tweetbot",            id: 557168941
mas "Twitter",             id: 1482454543
mas "Vimeo",               id: 1356686763
mas "Xcode",               id: 497799835
